<a href="https://colab.research.google.com/github/rammya29/Goeduhub-STP/blob/main/Assignment_Task_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Assignment / Task -10

###Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.

####**OneHot Encoding**

One-Hot Encoding is another popular technique for treating categorical variables. It simply creates additional features based on the number of unique values in the categorical feature. Every unique value in the category will be added as a feature.

####**Multicollinearity**

Multicollinearity is the occurrence of high intercorrelations among two or more independent variables in a multiple regression model. ... In general, multicollinearity can lead to wider confidence intervals that produce less reliable probabilities in terms of the effect of independent variables in a model.

####**Dummy Variable Trap**

The Dummy Variable trap is a scenario in which the independent variables are multicollinear - a scenario in which two or more variables are highly correlated; in simple terms one variable can be predicted from the others.

###What is Nominal and Ordinal Variables ?

A ***categorical variable*** (sometimes called a nominal variable) is one that has two or more categories, but there is no intrinsic ordering to the categories.  For example, a binary variable (such as yes/no question) is a categorical variable having two categories (yes or no) and there is no intrinsic ordering to the categories.  


An ***ordinal variable*** is similar to a categorical variable.  The difference between the two is that there is a clear ordering of the categories.  For example, suppose you have a variable, economic status, with three categories (low, medium and high).



---

###Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

Dataset Link- [Click here](https://data.princeton.edu/wws509/datasets/salary.dat)

In [7]:
import pandas as pd

df = pd.read_table('/content/SalartData.txt',delim_whitespace=True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [8]:
df.describe()

              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [10]:
df.columns

Index(['sx', 'rk', 'yr', 'dg', 'yd', 'sl'], dtype='object')

In [11]:
pd.get_dummies(df, columns = ['sx', 'rk' , 'dg']).head()

   yr  yd     sl  sx_female  ...  rk_associate  rk_full  dg_doctorate  dg_masters
0  25  35  36350          0  ...             0        1             1           0
1  13  22  35350          0  ...             0        1             1           0
2  10  23  28200          0  ...             0        1             1           0
3   7  27  26775          1  ...             0        1             1           0
4  19  30  33696          0  ...             0        1             0           1

[5 rows x 10 columns]

In [12]:
pd.get_dummies(df, columns = ['sx', 'rk' , 'dg'], drop_first=True).head()

   yr  yd     sl  sx_male  rk_associate  rk_full  dg_masters
0  25  35  36350        1             0        1           0
1  13  22  35350        1             0        1           0
2  10  23  28200        1             0        1           0
3   7  27  26775        0             0        1           0
4  19  30  33696        1             0        1           1

###OneHot Encoder

In [13]:
import numpy as np

In [19]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

col = ColumnTransformer([('encoder', OneHotEncoder(), [0,1,3])], remainder = 'passthrough')
data = np.array(col.fit_transform(df), dtype = str)

print(data[:7])

[['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '25.0' '35.0' '36350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '13.0' '22.0' '35350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '10.0' '23.0' '28200.0']
 ['1.0' '0.0' '0.0' '0.0' '1.0' '1.0' '0.0' '7.0' '27.0' '26775.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '0.0' '1.0' '19.0' '30.0' '33696.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '16.0' '21.0' '28516.0']
 ['1.0' '0.0' '0.0' '0.0' '1.0' '0.0' '1.0' '0.0' '32.0' '24900.0']]

#End Of Assignment

**Author** : Rammya Dharshini K

**Date** : 10-06-2021

**Reg. ID** : GO_STP_1613